{
    "partition": {
        "device": "sda",
        "mode": "auto",
        "efi": true,
        "partitions": [
            "/home:sdb:btrfs" // This would be disk /dev/sdb, formatted with btrfs mounted at /home
        ] // this is only needed for manual partitioning, it would contain all the partitions for jade to use and the filesystem as well as mountpoint
          // Note that the mountpoint has the root at the installation destination, so instead of /mnt/boot it would be /boot
    },
    "bootloader": {
        "type": "grub-efi", // for legacy this would be grub-legacy
        "location": "/boot/efi" // for efi this is the esp directory, for legacy boot this would be the device on which to install grub on
    },
    "locale": {
        "locale": [
            "en_US.UTF-8 UTF-8"
        ],
        "keymap": "colemak",
        "timezone": "Europe/Berlin"
    },
    "networking": {
        "hostname": "jade-test",
        "ipv6": false
    },
    "users": [
        {
            "name": "jade",
            "password": "TaCVRgYCAHag6", // The password has to be encrypted with `openssl passwd -crypt <passord>`
            "hasroot": true,
            "shell": "bash" // this can be either bash, csh, fish, tcsh or zsh. If a value is not recognized the default will be bash
        },
        { // Multiple users can be specified by just following this format
            "name": "jade2",
            "password": "TzSMi3EezsXZM",
            "hasroot": false,
            "shell": "fish"
        }
    ], 
    "rootpass": "3IwCDE/t39wuQ", // Same as other passwords, this has to be encrypted with `openssl passwd -crypt <password>`
    "desktop": "onyx", // The desktop environment to install can be onyx, gnome, kde, mate, cinnamon, xfce, budgie, enlightenment, etc. for a full list check https://github.com/crystal-linux/jade/blob/main/src/internal/config.rs#L162
    "timeshift": true, // Whether to enable timeshift as well as timeshift-autosnap, note that this may only work with root on btrfs
    "zramd": true, // Whether to enable zramd
    "extra_packages": [
        "firefox",
        "vim",
        "git",
        "tmux"
    ],
    "unakite": {
        "enable": false, // Whether to install the recorvery partition, note that this currently is just a secondary smaller crystal installation
        "root": "/dev/sda2", // The root partition for unakite
        "oldroot": "/dev/sda3", // The root partition that the main crystal installation uses
        "efidir": "/boot/efi", // The esp mountpoint in unakite, note that this is only read when using it on an efi system
        "bootdev": "/dev/sda1" // the partition for the boot/efi partition
    },
    "kernel": "linux" // which kernel to install, available options are linux, linux-zen, linux-lts, linux-hardened. When an unknown option is passed it will default to linux
}
